{
  "greeting": {
    "greeting": "Hi",
    "iam": "I'm",
    "name": "Julio Vaz 👋"
  },
  "page": {
    "menu": {},
    "sections": {
      "about": {
        "title": "ABOUT",
        "content": {
          "about": "I've been working with software engineering for over 6 years, currently I'm working in the core team at",
          "about-company": "Juntos Somos Mais",
          "about-experience": "as a frontend and mobile developer. During all these years, I worked with different technologies, languages and frameworks. I was able to acquire experience to lead projects and carry out quality deliveries. I currently focus on software architecture, CI/CD, testing and monitoring. Work on training new developers in the team, share and acquire new knowledge.",
          "about-technologies": "Working on projects with"
        },
        "actions": {
          "buttons": {
            "resume": "Resume",
            "blog": "Blog"
          }
        }
      },
      "experiences": {
        "title": "EXPERIENCES",
        "content": {
          "timeline": {
            "current": {
              "about": "Currently, contributing to improvements and deliveries on the",
              "about-experience": ", generating value for the end user. Integration with partner APIs and creation of development used by squads. Contributes for the",
              "about-notification": "library to ensure push notification on mobile application.",
              "conector": "and",
              "links": {
                "website": "website",
                "mobile": "mobile"
              }
            },
            "prev": {
              "about": " My job was creating the new",
              "about-experience": ", where users can interact with corporate info through their questions. I've built push notifications with Expo services. Also, I added deeplinks for easy access using a universal mechanism and app links. Implemented the Firebase dynamic links to facilitate the download app for the clients. Configured a version delivery workflow using development and Expo Release Channels."
            },
            "last": {
              "about": "My job involved reconstructing screens and creating new functionalities for the",
              "about-experience": "web system, catering to physical assessments and body measurement planning. I've streamlined the componentization process through atomic design concepts. Additionally, Participated in the development of a websocket communication feature between web and mobile using WebSocket API and Golang (Beego). Moreover, I took on the challenge of developing the mobile app Physical Test. It enables Bluetooth connectivity with a specific tool (adipometer) for accurate body measurement capture."
            }
          }
        }
      },
      "projects": "PROJECTS"
    }
  }
}
